NextFOAM-2606/applications/test/multiWorld/chtMultiRegionSimpleFoam/fluid/0/topAir/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    left
    {
        type            fixedValue;
        value           $internalField;
    }
    right
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
